Tekla Open API Reference for Tekla Structures 2025
AnalysisCrossSection.GetCrossSectionGroup Method
 Gets the cross section group.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisCrossSection> GetCrossSectionGroup()
Public Function GetCrossSectionGroup As List(Of AnalysisCrossSection)
Return Value
Type: List<AnalysisCrossSection>
The cross section group.
See Also
Reference
AnalysisCrossSection Class
Tekla.Structures.Analysis Namespace